 
                                  Wprowadz kod
§1                     Start rabat 1:
§1:§2                Koniec rabat 1:
§1:§2               Start rabat 2:
§1:§2                Koniec rabat 2:
§1:§2               Start rabat 3:
§1:§2                Koniec rabat 3:
§1:§2               Moneta      §1  §2
karta 0=acc.     Moneta      §1  §2
brak kart. 0=ac. Maks.kred. karty
§1                 1=PROG. 2=STATY.
3=TEST WYBORU      4=CZYSZ.5=SERWIS
6=TEST MODEMU      1=PROG. 2=STATY.
3=TEST  4=CZYSZ.   1=PROG. 2=STATY.
3=TEST  4=CZYSZ.   karta
rabatowa -  §1 %              Def. Vibr. mot.
Time gr.  §1  §2    Aktywny
                            nieuzywany
                         Produkt  §1
0=niedost.  §2.§3       Dozowanie w gr.
produkt §1  §2.§3   Opoznienie
produktu §1 §2.§3        l.ba przest.
0-2 15=max   §1        Woda  §1 czas
0=niedost.  §2.§3     Opoznienie
wody  §1    §2.§3        Mikser   §1
0=niedost.  §2.§3       Opoznienie
miksera §1  §2.§3        Przep. wody : §1
§2                 Nazwa wyboru  §1§2
§3               Opoznienie
ramienia    §1.§2        Programowanie:
§1                   Pred. miksera §1
§2                 Dzien tygodnia
§1.                  Zalacz o:
§1.     §2:§3             Wylacz o:
§1.     §2:§3             Czyszczenie o:
§1:§2                Godzina:
§1:§2                      Dzien  :
§1                         Miesiac:
§1                         Rok    :
§1                         Woda do kawy
0=niedost.cc:§1        Kolejnosc kawy
1=kawa przed   §1    Kilowatogodziny
§1.§2               X4 rinse 2 wat.
in brewer  §1ml     Pierwsza instal.
0=tak          §1  nieuzywany
                         Fresh Milk
§1                       Napiecie
volt:       §1.§2          Test modemu
wyb. 4                  nieuzywany
                         Przedwybor
                         Nieaktywny
                         X5 wait time 2
wat. brew. §1.§2s    Def. Vibr. mot.
Speed gr. §1  §2    Wyswietlanie
temperat.1=tak §1      X6 wait time 3
empty wat. §1.§2s    Wszystkie wybory
§1                 Ostatnie wybory
§1                  Wszys. pieniadze
§1                 Ostat. pieniadze
§1                 Wszystkie testy
§1                  Ostatnie testy
§1                   Wszy.wplacone na
karte§1 §2         Osta.wplacone na
karte§1 §2         Wszst. pobrane z
karty§1 §2         Ostat. pobrane z
karty§1 §2         Wszy.wplacone na
karte  §1          Osta.wplacone na
karte  §1          Wszst. pobrane z
karty  §1          Ostat. pobrane z
karty  §1          nieuzywany
                         nieuzywany
                         nieuzywany
                         nieuzywany
                         nieuzywany
                         nieuzywany
                         nieuzywany
                         nieuzywany
                         Ostat. §1 wyb. §2
§3                Ostat. wyb.  §1
§2                  Ostat. WYB.  §1
rabat  §2           Ostat. WYB.  §1
Dzbanek§2           Moneta §1
§2                        Cena   §1
§2                        Temperatura
EV1:        §1          Definicja
pierw. kawy  §1           Temperatura
Temp. EV2   §1          PL for cash
0=PL1 1=PL2    §1       Wybierz mlynek 2
1=tak          §1  nieuzywany
                         Info.przedwyboru
ZBOZOWA            REJESTRACJA-----
-USTEREK--------   Selection repeat
§1                 czas grzania
sec.: §1.§2            Temepratura
Temp. EV3   §1          PROGRAMOWANIE---
-WYBOR  §1         PROGRAMOWANIE---
-ZEGAR----------   PROGRAMOWANIE---
-CENY    §1        PROGRAMOWANIE---
-CENY-----------   PROGRAMOWANIE---
-MONETY---------   PROGRAMOWANIE---
-TEMPERATURY----   PROGRAMOWANIE---
-ROZNE----------   DIAGNOSTYKA-----
----------------   KONTROLA--------
-SPRZEDAZY------   PROGRAMOWANIE---
HAPPY PRICE=§1     PROGRAMOWANIE---
-HAPPY PRICES---   PROGRAMOWANIE---
-KONTR.PRODUKTU-   PROGRAMOWANIE---
-SERWIS---------   PROGRAMOWANIE---
-KARTA RFID-----   TEST SUCHY CUK.
wyb. 4              Torebka herbaty
0=niedostepna §1    Ilosc cykli
§1                      Przerwa cykli
sec:       §1         Wybór cyklu
0=staly        §1       Kod maszyny
A        §1             Kod maszyny
B        §1             Numer informacji
§1                 Typ wrzutnika
§1                    Kod dostepu
§1                      nieuzywany
                         Mieszadelko
0=przed 1=po   §1       Czas wentylatora
min.        §1     Czas sygnalu
§1.§2                  Punkt
dziesietny:    §1             PL for cashless
0=PL1 1=PL2    §1   Jezyk:
polski                       Zatrzymanue.wyb.
0=nie 1=tak  §1    nieuzywany
                         Temperatura
Delta        §1         nieuzywany
                         nieuzywany
                         Kalibra.Pompy §1
§2 §3 %            Kalib.produkt §1
§2 §3 %            Czas mielenia
§1.§2                 Kawa mlynek
w gr.       §1.§2       Kalibr. mlynka
§1 §2 %              Przedwybor
BEZ CUKRU                TEST MOV. CUKRU
sel 4               Przedwybor
BEZ CUKRU                Ekstra mleko
czas        +§1.§2     Latte-Macchiato
start parze.§1.§2   nieuzywany
                         Lim. pradowy 10A
                   nieuzywany
                         Temperatura
komora parz.:§1         nieuzywany
                         kawa ziarnista
[§1.§2]  §3.§4       Ilosc wody do
ESPRESSO   -§1 %      Pojemnik kawa
bezkof.   n:   §1     Cena k. bezkof.
0=+ 1=-       §1    Zawor-mikser
bezkof.   n:   §1      Dostep.przedwyb.
wybor   §1:§2      Pojemnik
cukier       n:§1          X7 rinsing
temperat.  §1            Nazwa przedwyb.
MALY NAPOJ          Mieszadelka
§1                      Nazwa przedwyb.
DODATKOWY CUKIER    Pojemnik
mleko        n:§1          Dostep. licznik.
0=nie 1=tak    §1  Dodatkowy cukier
czas        +§1.§2 Pojemnik kawa
zbozowa     n: §1     Zawor-mikser
zbozowa     n: §1      Zbozowa cena
0=+ 1=-       §1       n.§1 off §2 §3
§4:§5 §6-§7-20§8     n. §1  NIE
NIECZYNNE                Mieszadelka
§1                      Czujnik ob.kubka
1=dostepny     §1  Vibr.mot.
Time gr.     §1           Vibr. mot.
Speed gr.    §1          PWM Pump
§1%                        FREE VEND dost.
0=nie 1=1 2=++ §1   nieuzywany
                         Obsluga fusy
[§1]    §2             FREE VEND dost.
0=nie 1=1 2=++ §1   nieuzywany
                         nieuzywany
                         Produkt ilo.  §1
[§2.§3]  §4.§5     Info.przedwybo.
DZBANEK             Swieze mleko
czas        §1.§2      nieuzywany
                         Prod. §1 uwaga
Sprz: §2.§3          Zatrzy.produkt §1
1=Stop       §2   Wszystkie sp.dar
§1                 Ostatnie sp.dar.
§1                 Wszyst.pieniadze
§1                 Ostat. pieniadze
§1                 Wszy.wyb.gotowka
§1                 Osta.wyb.gotowka
§1                 Wszyst. cash-box
§1                 Ostat.  cash-box
§1                 Wszyst.wyb.karta
§1     §2          Ostat. wyb.karta
§1     §2          Wszyst.wyb.karta
§1                 Ostat. wyb.karta
§1                 Oproznianie tub
wyb.4-5-7-8-9-10    Rozmienianie
0=tak.  1=nie. §1      Maks. kredyt
§1                     Maks. reszta
§1                     Typ sprzedazy
0=poj.  1=wiel.§1     Wartosc zetonu:
§1                  Moneta      §1  §2
0=akcep. 1=nie.  Moneta br.re.§1 §2
0=akcep. 1=nie.  Ilosc pieniedzy
w tubach§1          Akcept.banknotow
dostep. 0;1;2 =§1  PROGRAMOWANIE---
-MDB------------   Info. przedwybo.
EKSTRA MLEKO       Info. przedwybo.
ESPRESSO           Info. przedwybo.
SELEKCJE 25-36     Info. przedwybo.
BEZKOFEINOWA       Info. przedwybo.
BEZ KUBKA          Info. przedwybo.
BEZ KUBKA          Info. przedwybo.
KAWA ZBOZOWA       TEST GROUP
Absorption  sel4         boiler  cc:
0=400   1=800  §1       nieuzywany
                         quick menu
access code  §1          Powietrze do
mleka       §1.§2      nieuzywany
                         KALIBRACJA------
-PRODUKTU-------   Kalibra. mlynka
p.PROG=start§1      Woda do mleka LM
numer=         §1  nieuzywany
                         Deinstalacja
10=start               Temperatura
espresso:   §1          nieuzywany
                         TEMPERATURA
boiler      §1          X8 Clousure
brewer      §1%         Temperatura
LM          §1          Kod    ID 101
§1                    Kod    ID 104
§1                    Kod    ID 106
§1                    Adres VIDTS
§1                      Protocol
§1                         Transfer  0=TMON
1=DDCMP 2=DIAG §1  nieuzywany
                         PROGRAMOWANIE---
-ID. AUTOMATU---   Czas letni
1=tak          §1        nieuzywany
                         LOW PRESSURE
                       X9 wait time 3
last cof. §1 min     X10 min cof. qty
to engage §1 cc    A1 PWM Variflex
move        §1%     A2 Pump On time
§1.§2[s]            Info. przedwybo.
SELEKCJE 37-48     Info. przedwybo.
CUP To Go          Czujnik kawy
0=nie 1=tak    §1      nieuzywany
                         Woda
procent    +§1 %               Cena   + lub -
0=+  1=-      §1     Produkt
procent    +§1 %            nieuzywany
                         nieuzywany
                         nieuzywany
                         nieuzywany
                         nieuzywany
                         Przedparzenie
0=nie     s:§1        Dzbanek
0=nie     n:§1              Info. przedwybo.
CUKIER             Info. przedwybo.
DUZY NAPOJ         Woda
DUZA       +§1 %               Numer wyboru.
Bingo       §1        CENA z karta
1=cena rabatowa§1      p.PROG = zaladuj
dane    §1         Cukier domyslny
LED:0-5      = §1   nieuzywany
                         A3 Pump OFF time
§1.§2[s]           A5 pressure
number        §1        PROGRAMOWANIE---
-MDB USD--------   Prog.  MDB USD §1
wyb. 4            Prog.  MDB USD
wyb. 4               FLUX produkt  §1
gr/s      §2       Stat. prod. §1
osta.gr§2            Stat. prod.  §1
wszy.gr§2           PROGRAMOWANIE---
-PRODUKT FLUX---   STATYSTYKA------
-PRODUKT FLUX---   TEST MOTOR
Absorption  sel4         Kalibracja    §1
mlynka   §2 §3 %   nieuzywany
                         Reset licz.opad
H2O 0=nie 1=tak§1   nieuzywany
                         A6 water after
coffee   §1[ml]      A7 chamber
aperture    §1%          DA rotation
0=auto 1=man.  §1       Set preheating
selection §1         MDB offset own
cup 0=no 1=yes §1    Granulometria
§1                    nieuzywany
                         pricehold query
no=0 yes=1     §1   Side water pump
0-4           §1    Dekompresja
komory 0-10mm §1        Podwojna kawa
0=nie 1=tak    §1     Czujnik obecno.
tacki. 1=tak   §1   nieuzywany
                         Info.przedwyboru
§1                 nieuzywany
                         Cup size
§1                         vend payment
timeout §1 sec.        Opoznien.swieze.
mleka      §1.§2   Opoznien.Powiet.
swiez.mleka §1.§2  nieuzywany
                         nieuzywany
                         PROGRAMOWANIE---
-VARIGRIND §1----  A7 chamber
aperture    §1%          PROGRAMOWANIE---
-CAPPUCCINATOR--   Wydawanie kubka
0=tak 1=nie    §1   nieuzywany
                         nieuzywany
                         PROGRAMOWANIE---
-VARIGRIND 2 ---   PRESEL. NUM §1§2
§3                 Zweryfikow. dane
§1                 Water Flush mode
1=ON 0=OFF §1       
                                  xxxxxx
                             PROGRAMOWANIE---
-BLOKADA RFID---   blok. karty  §1
numer       §2      Test stanowiska
wydawania syb.4     nieuzywany
                         PROGRAMOWANIE---
VARIFLEX           PROGRAMOWANIE---
MICRO              PROGRAMOWANIE---
                   Temperatura
EV4:        §1          Wstępna selekcja
SELEKCJE 49-60     xxxxxx
                             xxxxxx
                             nieuzywany
                         Czyszcze. obwodu
sw. mleka  §1:§2   Przelac.na mleko
instant tak=1  §1  Kalibra.mlynka 2
p.PROG=start§1     cup sens.thresh.
0=dis  §1 - §2     Set Free Vend
Ins hours   §1        Enable dataaudit
before  1=yes  §1  Instant Scaling
Factor   §1 §2 %    Test mieszadelka
wyb. 4             Security Level
level 1-4      §1    Calibrate Cof  3
Push PROG   §1     Calibrate Cof  4
Push PROG   §1     coffee repeat
0=disabled     §1     Current language
§1                 Zalacz o:
§1.     §2:§3             X4 rinse 2 wat.
in brewer  §1ml     Napiecie
volt:       §1.§2          REJESTRACJA-----
-USTEREK--------   Mieszadelko
0=przed 1=po   §1       Punkt
dziesietny:    §1             Czujnik ob.kubka
1=dostepny     §1  Zawor-mikser
bezkof.   n:   §1      nieuzywany
                         l.ba przest.
0-2 12=max   §1        Power adj. pump
0=no 1=yes  §1      